Autodesk.Revit.DB.Plumbing.PipingSystem.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String)
Creates a new instance of a piping system and adds it to the document.
ADocument:
The document where the element will be created and added.
typeId:
The identifier of this piping system element's type.
name:
The name of the piping system to be created.
Returns:
The newly created piping system element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The typeId is not an element id for a valid piping system type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Plumbing.PipingSystem.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a new instance of a piping system and adds it to the document.
ADocument:
The document where the element will be created and added.
typeId:
The identifier of this piping system element's type.
Returns:
The newly created piping system element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The typeId is not an element id for a valid piping system type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011